[Killed] BooleanLiteral
src/utils/common.ts:8:15
 export function debounce<T extends unknown[]>(
   func: (...args: T) => void,
   wait: number,
-  immediate = false
+  immediate = true
 ): DebounceFunction<T> {
   let timeout: NodeJS.Timeout | undefined;
killedBy: Utils debounce should delay function execution
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] BlockStatement
src/utils/common.ts:9:24
   func: (...args: T) => void,
   wait: number,
   immediate = false
-): DebounceFunction<T> {
-  let timeout: NodeJS.Timeout | undefined;
-
-  const debouncedFunction = function(this: unknown, ...args: T) {
-    const later = () => {
-      timeout = undefined;
-      if (!immediate) func.apply(this, args);
-    };
-    const callNow = immediate && !timeout;
-    clearTimeout(timeout);
-    timeout = setTimeout(later, wait);
-    if (callNow) func.apply(this, args);
-  };
-
-  return debouncedFunction;
-}
+): DebounceFunction<T> {}
 
 export function safeJsonParse<T = unknown>(jsonString: string, fallback?: T): T | null {
killedBy: Utils debounce should delay function execution
statusReason: TypeError: debouncedFn is not a function

[Killed] BlockStatement
src/utils/common.ts:12:65
 ): DebounceFunction<T> {
   let timeout: NodeJS.Timeout | undefined;
 
-  const debouncedFunction = function(this: unknown, ...args: T) {
-    const later = () => {
-      timeout = undefined;
-      if (!immediate) func.apply(this, args);
-    };
-    const callNow = immediate && !timeout;
-    clearTimeout(timeout);
-    timeout = setTimeout(later, wait);
-    if (callNow) func.apply(this, args);
-  };
+  const debouncedFunction = function(this: unknown, ...args: T) {};
 
   return debouncedFunction;
killedBy: Utils debounce should delay function execution
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/utils/common.ts:13:25
   let timeout: NodeJS.Timeout | undefined;
 
   const debouncedFunction = function(this: unknown, ...args: T) {
-    const later = () => {
-      timeout = undefined;
-      if (!immediate) func.apply(this, args);
-    };
+    const later = () => {};
     const callNow = immediate && !timeout;
     clearTimeout(timeout);
killedBy: Utils debounce should delay function execution
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/utils/common.ts:15:11
   const debouncedFunction = function(this: unknown, ...args: T) {
     const later = () => {
       timeout = undefined;
-      if (!immediate) func.apply(this, args);
+      if (immediate) func.apply(this, args);
     };
     const callNow = immediate && !timeout;
killedBy: Utils debounce should delay function execution
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/utils/common.ts:15:11
   const debouncedFunction = function(this: unknown, ...args: T) {
     const later = () => {
       timeout = undefined;
-      if (!immediate) func.apply(this, args);
+      if (false) func.apply(this, args);
     };
     const callNow = immediate && !timeout;
killedBy: Utils debounce should delay function execution
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] LogicalOperator
src/utils/common.ts:17:21
       timeout = undefined;
       if (!immediate) func.apply(this, args);
     };
-    const callNow = immediate && !timeout;
+    const callNow = immediate || !timeout;
     clearTimeout(timeout);
     timeout = setTimeout(later, wait);
killedBy: Utils debounce should delay function execution
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] ConditionalExpression
src/utils/common.ts:17:21
       timeout = undefined;
       if (!immediate) func.apply(this, args);
     };
-    const callNow = immediate && !timeout;
+    const callNow = true;
     clearTimeout(timeout);
     timeout = setTimeout(later, wait);
killedBy: Utils debounce should delay function execution
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] ConditionalExpression
src/utils/common.ts:20:9
     const callNow = immediate && !timeout;
     clearTimeout(timeout);
     timeout = setTimeout(later, wait);
-    if (callNow) func.apply(this, args);
+    if (true) func.apply(this, args);
   };
 
killedBy: Utils debounce should delay function execution
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Survived] ConditionalExpression
src/utils/common.ts:20:9
     const callNow = immediate && !timeout;
     clearTimeout(timeout);
     timeout = setTimeout(later, wait);
-    if (callNow) func.apply(this, args);
+    if (false) func.apply(this, args);
   };
 

[Killed] BlockStatement
src/utils/common.ts:26:88
   return debouncedFunction;
 }
 
-export function safeJsonParse<T = unknown>(jsonString: string, fallback?: T): T | null {
-  try {
-    return JSON.parse(jsonString) as T;
-  } catch (error) {
-    logger.warn('Failed to parse JSON:', error);
-    return fallback ?? null;
-  }
-}
+export function safeJsonParse<T = unknown>(jsonString: string, fallback?: T): T | null {}
 
 export function safeJsonStringify(obj: unknown, fallback = '{}'): string {
killedBy: Utils safeJsonParse should parse valid JSON
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"test": "value"}
Received: undefined

[Killed] BlockStatement
src/utils/common.ts:27:7
 }
 
 export function safeJsonParse<T = unknown>(jsonString: string, fallback?: T): T | null {
-  try {
-    return JSON.parse(jsonString) as T;
-  } catch (error) {
+  try {} catch (error) {
     logger.warn('Failed to parse JSON:', error);
     return fallback ?? null;
killedBy: Utils safeJsonParse should parse valid JSON
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"test": "value"}
Received: undefined

[Killed] BlockStatement
src/utils/common.ts:29:19
 export function safeJsonParse<T = unknown>(jsonString: string, fallback?: T): T | null {
   try {
     return JSON.parse(jsonString) as T;
-  } catch (error) {
-    logger.warn('Failed to parse JSON:', error);
-    return fallback ?? null;
-  }
+  } catch (error) {}
 }
 
killedBy: Utils safeJsonParse should return fallback for invalid JSON
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"default": true}
Received: undefined

[Killed] LogicalOperator
src/utils/common.ts:31:12
     return JSON.parse(jsonString) as T;
   } catch (error) {
     logger.warn('Failed to parse JSON:', error);
-    return fallback ?? null;
+    return fallback && null;
   }
 }
killedBy: Utils safeJsonParse should return fallback for invalid JSON
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"default": true}
Received: null

[Killed] BlockStatement
src/utils/common.ts:35:74
   }
 }
 
-export function safeJsonStringify(obj: unknown, fallback = '{}'): string {
-  try {
-    return JSON.stringify(obj, null, 2);
-  } catch (error) {
-    logger.warn('Failed to stringify object:', error);
-    return fallback;
-  }
-}
+export function safeJsonStringify(obj: unknown, fallback = '{}'): string {}
 
 // Generates lowercase alphanumeric ID (a-z0-9)
killedBy: Utils safeJsonStringify should stringify objects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{
  \"test\": \"value\"
}"
Received: undefined

[Killed] BlockStatement
src/utils/common.ts:36:7
 }
 
 export function safeJsonStringify(obj: unknown, fallback = '{}'): string {
-  try {
-    return JSON.stringify(obj, null, 2);
-  } catch (error) {
+  try {} catch (error) {
     logger.warn('Failed to stringify object:', error);
     return fallback;
killedBy: Utils safeJsonStringify should stringify objects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{
  \"test\": \"value\"
}"
Received: undefined

[Killed] BlockStatement
src/utils/common.ts:38:19
 export function safeJsonStringify(obj: unknown, fallback = '{}'): string {
   try {
     return JSON.stringify(obj, null, 2);
-  } catch (error) {
-    logger.warn('Failed to stringify object:', error);
-    return fallback;
-  }
+  } catch (error) {}
 }
 
killedBy: Utils safeJsonStringify should handle circular references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{}"
Received: undefined

[Killed] BlockStatement
src/utils/common.ts:46:38
 
 // Generates lowercase alphanumeric ID (a-z0-9)
 // NOTE: ID validation in ipc-handlers.ts depends on this format - update both if changed
-export function generateId(): string {
-  return Date.now().toString(TIME_CALCULATIONS.TIMESTAMP_BASE) + Math.random().toString(TIME_CALCULATIONS.TIMESTAMP_BASE).substring(TIME_CALCULATIONS.RANDOM_ID_START, TIME_CALCULATIONS.RANDOM_ID_END);
-}
+export function generateId(): string {}
 
 export function sleep(ms: number): Promise<void> {
killedBy: Utils generateId should generate unique IDs
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ArithmeticOperator
src/utils/common.ts:47:10
 // Generates lowercase alphanumeric ID (a-z0-9)
 // NOTE: ID validation in ipc-handlers.ts depends on this format - update both if changed
 export function generateId(): string {
-  return Date.now().toString(TIME_CALCULATIONS.TIMESTAMP_BASE) + Math.random().toString(TIME_CALCULATIONS.TIMESTAMP_BASE).substring(TIME_CALCULATIONS.RANDOM_ID_START, TIME_CALCULATIONS.RANDOM_ID_END);
+  return Date.now().toString(TIME_CALCULATIONS.TIMESTAMP_BASE) - Math.random().toString(TIME_CALCULATIONS.TIMESTAMP_BASE).substring(TIME_CALCULATIONS.RANDOM_ID_START, TIME_CALCULATIONS.RANDOM_ID_END);
 }
 
killedBy: Utils generateId should generate unique IDs
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not NaN

[Survived] MethodExpression
src/utils/common.ts:47:66
 // Generates lowercase alphanumeric ID (a-z0-9)
 // NOTE: ID validation in ipc-handlers.ts depends on this format - update both if changed
 export function generateId(): string {
-  return Date.now().toString(TIME_CALCULATIONS.TIMESTAMP_BASE) + Math.random().toString(TIME_CALCULATIONS.TIMESTAMP_BASE).substring(TIME_CALCULATIONS.RANDOM_ID_START, TIME_CALCULATIONS.RANDOM_ID_END);
+  return Date.now().toString(TIME_CALCULATIONS.TIMESTAMP_BASE) + Math.random().toString(TIME_CALCULATIONS.TIMESTAMP_BASE);
 }
 

[Killed] BlockStatement
src/utils/common.ts:50:50
   return Date.now().toString(TIME_CALCULATIONS.TIMESTAMP_BASE) + Math.random().toString(TIME_CALCULATIONS.TIMESTAMP_BASE).substring(TIME_CALCULATIONS.RANDOM_ID_START, TIME_CALCULATIONS.RANDOM_ID_END);
 }
 
-export function sleep(ms: number): Promise<void> {
-  return new Promise(resolve => setTimeout(resolve, ms));
-}
+export function sleep(ms: number): Promise<void> {}
 
killedBy: Utils sleep should delay execution
statusReason: Error: expect(received).resolves.toBeUndefined()

Matcher error: received value must be a promise

Received has value: undefined

[Killed] ArrowFunction
src/utils/common.ts:51:22
 }
 
 export function sleep(ms: number): Promise<void> {
-  return new Promise(resolve => setTimeout(resolve, ms));
+  return new Promise(() => undefined);
 }
 
killedBy: Utils sleep should delay execution
statusReason: Error: thrown: "Exceeded timeout of 10000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
